# install the python from the google

# Go window powershell terminal for install pandas  library & jupyter nootbook
# pip install pandas  for install pandas library
# pip install --upgrade pandas  for update the pandas library

# pip install numpy  for install the numpy library
# pip install --upgrade numpy  for update the numpy library

# pip install jupyter nootbook  for install jupyter notebook
# jupyter nootbook  Run this command in cmd for open jupyter notebook

# after install the jupyter notebook open that and create a python file than

# import pandas and numpy library.
# import numpy as np
# import pandas as pd

In [1]:
import pandas as pd

In [2]:
d = {
    "name" : ["yash","Aman","Rahul"],
    "Age" : [21,22,23]
}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

    name  Age
0   yash   21
1   Aman   22
2  Rahul   23

In [5]:
df.head

<bound method NDFrame.head of     name  Age
0   yash   21
1   Aman   22
2  Rahul   23>

In [6]:
df.head(2)

   name  Age
0  yash   21
1  Aman   22

In [7]:
df.tail

<bound method NDFrame.tail of     name  Age
0   yash   21
1   Aman   22
2  Rahul   23>

In [8]:
df.tail(2)

    name  Age
1   Aman   22
2  Rahul   23

In [9]:
df.shape

(3, 2)

In [10]:
df.describe

<bound method NDFrame.describe of     name  Age
0   yash   21
1   Aman   22
2  Rahul   23>

In [11]:
df["name"]

0     yash
1     Aman
2    Rahul
Name: name, dtype: object

In [12]:
df["Age"]

0    21
1    22
2    23
Name: Age, dtype: int64

In [13]:
df["name"][0]

'yash'

In [14]:
df["name"][2]

'Rahul'

In [15]:
df["Age"]

0    21
1    22
2    23
Name: Age, dtype: int64

In [16]:
df["Age"][0]

21

In [17]:
df.dtypes

name    object
Age      int64
dtype: object

In [18]:
type("name")

str

In [19]:
df

    name  Age
0   yash   21
1   Aman   22
2  Rahul   23

In [20]:
df.index = ["First","Second","Third"]

In [21]:
df

         name  Age
First    yash   21
Second   Aman   22
Third   Rahul   23

# Pandas = Pandas is a software library written for the Python programming language for data manipulation and analysis.Pandas is a powerful and open-source Python library. The Pandas library is used for data manipulation and analysis.

# Jupyter = Project Jupyter is a project to develop open-source software, open standards, and services for interactive computing across multiple programming languages.

# Pandas DataFrame = A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
# import pandas as pd

# Pandas Series = A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type.

In [22]:
data = {
    "name" : ["Yash","Anuj","Vinay"],
    "Age" : [22,23,21]
}

In [23]:
dframe = pd.DataFrame(data)

In [24]:
dframe

    name  Age
0   Yash   22
1   Anuj   23
2  Vinay   21

In [25]:
col = pd.Series(data)

In [26]:
col["name"]

['Yash', 'Anuj', 'Vinay']

In [27]:
a = [21,22,34]

In [28]:
pd.Series(a)

0    21
1    22
2    34
dtype: int64

In [29]:
dframe.T

         0     1      2
name  Yash  Anuj  Vinay
Age     22    23     21

In [30]:
# OR   dframe1 = dframe[:]
dframe1 = dframe.copy()

In [31]:
dframe1

    name  Age
0   Yash   22
1   Anuj   23
2  Vinay   21

In [32]:
dframe.sort_index(axis = 0,ascending = False)

    name  Age
2  Vinay   21
1   Anuj   23
0   Yash   22

In [33]:
dframe.loc[0]

name    Yash
Age       22
Name: 0, dtype: object

In [34]:
dframe[0,0]= "Abhiraj"

In [35]:
dframe

    name  Age   (0, 0)
0   Yash   22  Abhiraj
1   Anuj   23  Abhiraj
2  Vinay   21  Abhiraj

In [36]:
dframe

    name  Age   (0, 0)
0   Yash   22  Abhiraj
1   Anuj   23  Abhiraj
2  Vinay   21  Abhiraj

In [37]:
dframe[0,0]

0    Abhiraj
1    Abhiraj
2    Abhiraj
Name: (0, 0), dtype: object

In [38]:
dframe.index

RangeIndex(start=0, stop=3, step=1)

In [39]:
dframe.columns

Index(['name', 'Age', (0, 0)], dtype='object')

In [40]:
dframe.drop((0,0),axis = 1,inplace = True)

In [41]:
dframe

    name  Age
0   Yash   22
1   Anuj   23
2  Vinay   21

In [42]:
dframe.loc[0,'name']

'Yash'

In [43]:
dframe.loc[0,'name'] = "Abhiraj"

In [44]:
dframe

      name  Age
0  Abhiraj   22
1     Anuj   23
2    Vinay   21

In [45]:
dframe.loc[[0,1],['name','Age']]

      name  Age
0  Abhiraj   22
1     Anuj   23

In [46]:
dframe.loc[:,['name']]

      name
0  Abhiraj
1     Anuj
2    Vinay

In [47]:
dframe.loc[[0,1],:]

      name  Age
0  Abhiraj   22
1     Anuj   23

In [48]:
dframe.loc[dframe["name"] == "Anuj"]

   name  Age
1  Anuj   23

In [49]:
dframe.loc[dframe["Age"] > 21]

      name  Age
0  Abhiraj   22
1     Anuj   23

In [50]:
dframe

      name  Age
0  Abhiraj   22
1     Anuj   23
2    Vinay   21

In [51]:
dframe.loc[(dframe["name"] == "Abhiraj") & (dframe["Age"] == 23)]

Empty DataFrame
Columns: [name, Age]
Index: []

In [52]:
dframe.loc[(dframe["name"] == "Abhiraj") | (dframe["Age"] ==23)]

      name  Age
0  Abhiraj   22
1     Anuj   23

In [53]:
# iloc works like a Matrix
dframe.iloc[0,0]

'Abhiraj'

In [54]:
dframe.iloc[0,1]

22

In [55]:
dframe.iloc[1,0]

'Anuj'

In [56]:
dframe.iloc[[0,1],[0,1]]

      name  Age
0  Abhiraj   22
1     Anuj   23

In [57]:
dframe['name'].notnull()

0    True
1    True
2    True
Name: name, dtype: bool

In [58]:
dframe['name'].isnull()

0    False
1    False
2    False
Name: name, dtype: bool

# Thank You ! You Watched this Video at the END
# Maybe This Video is Very Helpful for You
# Please Subscribe the Channel Comment & Like Also !
# Thank You All !